ms-python.python
ms-python.vscode-pylance
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
twxs.cmake
ms-vscode.cmake-tools
GrapeCity.gc-excelviewer
ms-toolsai.jupyter
ms-dotnettools.csharp
tomoki1207.pdf
slevesque.vscode-zipexplorer
ms-vscode.PowerShell
rust-lang.rust
docsmsft.docs-yaml
docsmsft.docs-markdown
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
vscjava.vscode-java-pack
ms-vscode.hexeditor
ms-dotnettools.vscode-dotnet-pack
ms-vscode.makefile-tools
vscodevim.vim
ms-vscode.atom-keybindings
ms-vscode.notepadplusplus-keybindings